Tekla Open API Reference for Tekla Structures 2025
Part.GetReferenceLine Method
 Returns the reference line for the given part.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetReferenceLine(
	bool withCutsFittings
)
Public Function GetReferenceLine (
	withCutsFittings As Boolean
) As ArrayList
Parameters
withCutsFittings
Type: System.Boolean
Defines if the reference line is created from a solid with cuts and fittings or not.
Return Value
Type: ArrayList
A list of points that define the reference line for the given part.
See Also
Reference
Part Class
Tekla.Structures.Model Namespace